; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image3 - mode
	spectrograph4 - mode
	image5 - mode
	infrared1 - mode
	infrared9 - mode
	image0 - mode
	image7 - mode
	thermograph2 - mode
	image8 - mode
	infrared6 - mode
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 image8)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 spectrograph4)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph4)
	(supports instrument2 image7)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument3 infrared6)
	(supports instrument3 infrared9)
	(calibration_target instrument3 Star4)
	(supports instrument4 image7)
	(supports instrument4 thermograph2)
	(supports instrument4 image3)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
)
(:goal (and
	(pointing satellite1 Planet10)
	(have_image Star5 image7)
	(have_image Star5 infrared1)
	(have_image Star5 image3)
	(have_image Planet6 spectrograph4)
	(have_image Planet6 infrared9)
	(have_image Planet7 spectrograph4)
	(have_image Planet7 image7)
	(have_image Planet8 image7)
	(have_image Star9 thermograph2)
	(have_image Planet10 infrared6)
	(have_image Planet10 infrared9)
))

)

; plan
1. (turn_to satellite1 star4 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star4)
   goals met: 0 of 12
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 12
3. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 0 of 12
4. (turn_to satellite1 star9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star9)
   goals met: 0 of 12
5. (take_image satellite1 star9 instrument4 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 1 of 12
6. (turn_to satellite1 star5 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star5)
   goals met: 1 of 12
7. (turn_to satellite0 star2 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star2)
   goals met: 1 of 12
8. (take_image satellite1 star5 instrument4 image3)
   added: (have_image star5 image3)
   goals met: 2 of 12
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 12
10. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 2 of 12
11. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 2 of 12
12. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 12
13. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 2 of 12
14. (take_image satellite0 planet6 instrument2 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 3 of 12
15. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 3 of 12
16. (take_image satellite0 planet7 instrument2 image7)
   added: (have_image planet7 image7)
   goals met: 4 of 12
17. (take_image satellite0 planet7 instrument2 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 5 of 12
18. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 5 of 12
19. (take_image satellite0 planet8 instrument2 image7)
   added: (have_image planet8 image7)
   goals met: 6 of 12
20. (turn_to satellite0 star5 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star5)
   goals met: 6 of 12
21. (take_image satellite0 star5 instrument2 image7)
   added: (have_image star5 image7)
   goals met: 7 of 12
22. (take_image satellite0 star5 instrument2 infrared1)
   added: (have_image star5 infrared1)
   goals met: 8 of 12
23. (turn_to satellite1 star4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star4)
   goals met: 8 of 12
24. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 8 of 12
25. (turn_to satellite1 planet6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet6)
   goals met: 8 of 12
26. (take_image satellite1 planet6 instrument3 infrared9)
   added: (have_image planet6 infrared9)
   goals met: 9 of 12
27. (turn_to satellite1 planet10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet10)
   goals met: 10 of 12
28. (take_image satellite1 planet10 instrument3 infrared6)
   added: (have_image planet10 infrared6)
   goals met: 11 of 12
29. (take_image satellite1 planet10 instrument3 infrared9)
   added: (have_image planet10 infrared9)
   goals met: 12 of 12
